//=============================================
//
//エネミーのステートパターン[enemy_state.cpp]
//Auther Matsuda Towa
//
//=============================================
#include "enemy_state.h"

//=============================================
//エネミーの移動
//=============================================
void CEnemyState::Move(CCharacter* character)
{
}

//=============================================
//エネミーの混乱状態
//=============================================
void CEnemyState::Wandering(CEnemy* enemy)
{
}
//=============================================
//エネミーの移動状態(雑魚敵のみ) TODO:ならステートパターン組み換えよう
//=============================================
void CEnemyMoveState::Move(CCharacter* character)
{
	character->m_pMove->Move(character);
}
