//=============================================
//
//ゲームスコア処理「game_scorer.cpp」
// Author松田永久
//
//=============================================
#include "game_score.h"

const float CGameScore::DIGIT_SHIFT = 50.0f;

//=============================================
//コンストラクタ
//=============================================
CGameScore::CGameScore()
{
}

//=============================================
//デストラクタ
//=============================================
CGameScore::~CGameScore()
{
}

//=============================================
//初期化
//=============================================
HRESULT CGameScore::Init()
{
	D3DXVECTOR3 pos = D3DXVECTOR3(300.0f, 300.0f, 0.0f);
	CScore::SetPos(pos);
	CScore::SetDigitShift(DIGIT_SHIFT);
	CScore::Init();
	return S_OK;
}

//=============================================
//終了
//=============================================
void CGameScore::Uninit()
{
	CScore::Uninit();
}

//=============================================
//更新
//=============================================
void CGameScore::Update()
{
	CScore::Update();
}
